In [1]:
import pandas as pd
import matplotlib.pyplot as splt
%matplotlib inline

In [2]:
df = pd.read_csv('status.csv')

In [3]:
df

    age  status
0    18     0.0
1    21     1.0
2    23     0.0
3    24     1.0
4    25     1.0
5    22     1.0
6    17     0.0
7    15     1.0
8    19     1.0
9    20     0.0
10   26     NaN
11   17     1.0
12   28     0.0
13   29     1.0
14   30     0.0
15   24     1.0
16   20     0.0
17   50     1.0
18   33     0.0

In [4]:
df.shape

(19, 2)

In [5]:
df.isnull().sum()

age       0
status    1
dtype: int64

In [6]:
handle = df['status'].median()

In [7]:
handle

1.0

In [15]:
df.status = df.status.fillna(handle)

In [16]:
df

    age  status
0    18     0.0
1    21     1.0
2    23     0.0
3    24     1.0
4    25     1.0
5    22     1.0
6    17     0.0
7    15     1.0
8    19     1.0
9    20     0.0
10   26     1.0
11   17     1.0
12   28     0.0
13   29     1.0
14   30     0.0
15   24     1.0
16   20     0.0
17   50     1.0
18   33     0.0

In [17]:
df['status'].value_counts()

1.0    11
0.0     8
Name: status, dtype: int64

In [18]:
x = df[['age']]

In [19]:
x

    age
0    18
1    21
2    23
3    24
4    25
5    22
6    17
7    15
8    19
9    20
10   26
11   17
12   28
13   29
14   30
15   24
16   20
17   50
18   33

In [20]:
y = df[['status']]

In [21]:
y

    status
0      0.0
1      1.0
2      0.0
3      1.0
4      1.0
5      1.0
6      0.0
7      1.0
8      1.0
9      0.0
10     1.0
11     1.0
12     0.0
13     1.0
14     0.0
15     1.0
16     0.0
17     1.0
18     0.0

In [22]:
from sklearn.model_selection import train_test_split

In [23]:
xtrain,xtest,ytrain,ytest=train_test_split(x,y,test_size =.30,random_state=1)

In [24]:
xtrain

    age
4    25
16   20
7    15
1    21
13   29
0    18
18   33
17   50
9    20
8    19
12   28
11   17
5    22

In [25]:
xtest

    age
3    24
15   24
6    17
10   26
2    23
14   30

In [26]:
ytest

    status
3      1.0
15     1.0
6      0.0
10     1.0
2      0.0
14     0.0

In [27]:
from sklearn.linear_model import LogisticRegression

In [32]:
model = LogisticRegression()

In [34]:
model.fit(xtrain,ytrain)

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)

LogisticRegression()

In [35]:
model.predict(xtest)

array([1., 1., 1., 1., 1., 1.])

In [36]:
model.score(xtest,ytest)

0.5

In [37]:
model.predict_proba(xtest)

array([[0.3853707 , 0.6146293 ],
       [0.3853707 , 0.6146293 ],
       [0.40582472, 0.59417528],
       [0.37959691, 0.62040309],
       [0.38826985, 0.61173015],
       [0.3681524 , 0.6318476 ]])